# 데이터 수집

In [34]:
import pandas as pd

In [35]:
rock_samples = pd.read_csv('/workspaces/github_codespace_demo/data/rocksamples.csv')    #절대경로
#rock_samples = pd.read_csv('../data/rocksamples.csv')                                  #상대경로(동작 안 됨)
#디렉토리가 한 단계 아래에 있기 때문에 notebook에서 data찾으므로 오류가 남(../../ 필요)

In [36]:
rock_samples.head()

      ID   Mission    Type   Subtype  Weight (g)  Pristine (%)
0  10001  Apollo11    Soil  Unsieved       125.8         88.36
1  10002  Apollo11    Soil  Unsieved      5629.0         93.73
2  10003  Apollo11  Basalt  Ilmenite       213.0         65.56
3  10004  Apollo11    Core  Unsieved        44.8         71.76
4  10005  Apollo11    Core  Unsieved        53.4         40.31

In [37]:
rock_samples.tail()

         ID   Mission     Type   Subtype  Weight (g)  Pristine (%)
2224  79528  Apollo17  Breccia  Regolith        2.38         100.0
2225  79529  Apollo17  Breccia  Regolith        1.84         100.0
2226  79535  Apollo17  Breccia  Regolith        1.69         100.0
2227  79536  Apollo17  Breccia  Regolith        1.66         100.0
2228  79537  Apollo17  Breccia  Regolith        1.05         100.0

In [38]:
rock_samples.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2229 entries, 0 to 2228
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            2229 non-null   int64
 1   Mission       2229 non-null   object
 2   Type          2229 non-null   object
 3   Subtype       2226 non-null   object
 4   Weight (g)    2229 non-null   float64
 5   Pristine (%)  2229 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 104.6+ KB

In [39]:
rock_samples.shape      #dataframe's row & column

(2229, 6)

In [40]:
rock_samples.shape[0]   #dataframe row

2229

In [41]:
rock_samples.shape[1]   #dataframe column

6

In [42]:
rock_samples.index      #dataframe index

RangeIndex(start=0, stop=2229, step=1)

In [43]:
rock_samples.columns    #dataframe column name

Index(['ID', 'Mission', 'Type', 'Subtype', 'Weight (g)', 'Pristine (%)'], dtype='object')

In [44]:
rock_samples.dtypes     #dataframe data type(each column)

ID                int64
Mission          object
Type             object
Subtype          object
Weight (g)      float64
Pristine (%)    float64
dtype: object

In [45]:
rock_samples.describe() #dataframe data summary

                 ID    Weight (g)  Pristine (%)
count   2229.000000   2229.000000   2229.000000
mean   52058.432032    168.253024     84.512764
std    26207.651471    637.286458     22.057299
min    10001.000000      0.000000      0.000000
25%    15437.000000      3.000000     80.010000
50%    65527.000000     10.200000     92.300000
75%    72142.000000     93.490000     98.140000
max    79537.000000  11729.000000    180.000000

## 누락값 검사

In [46]:
rock_samples.isnull()   #step1. find null value in dataframe

         ID  Mission   Type  Subtype  Weight (g)  Pristine (%)
0     False    False  False    False       False         False
1     False    False  False    False       False         False
2     False    False  False    False       False         False
3     False    False  False    False       False         False
4     False    False  False    False       False         False
...     ...      ...    ...      ...         ...           ...
2224  False    False  False    False       False         False
2225  False    False  False    False       False         False
2226  False    False  False    False       False         False
2227  False    False  False    False       False         False
2228  False    False  False    False       False         False

[2229 rows x 6 columns]

In [47]:
rock_samples.isnull().sum() #step2. sum each column value(false:0, true:1)

ID              0
Mission         0
Type            0
Subtype         3
Weight (g)      0
Pristine (%)    0
dtype: int64

# 데이터 가공

In [48]:
sample_series = rock_samples['Weight (g)'] 
sample_series

0        125.80
1       5629.00
2        213.00
3         44.80
4         53.40
         ...
2224       2.38
2225       1.84
2226       1.69
2227       1.66
2228       1.05
Name: Weight (g), Length: 2229, dtype: float64

In [49]:
sample_dataframe = rock_samples[['Type', 'Weight (g)']]
sample_dataframe

         Type  Weight (g)
0        Soil      125.80
1        Soil     5629.00
2      Basalt      213.00
3        Core       44.80
4        Core       53.40
...       ...         ...
2224  Breccia        2.38
2225  Breccia        1.84
2226  Breccia        1.69
2227  Breccia        1.66
2228  Breccia        1.05

[2229 rows x 2 columns]

In [50]:
# step1. change column value (weinght (g->kg))
rock_samples['Weight (g)'] = sample_series.apply(lambda x : x * 0.001)
rock_samples['Weight (g)']

0       0.12580
1       5.62900
2       0.21300
3       0.04480
4       0.05340
         ...
2224    0.00238
2225    0.00184
2226    0.00169
2227    0.00166
2228    0.00105
Name: Weight (g), Length: 2229, dtype: float64

In [51]:
# step2. rename column(Weight(g)->Weight(kg))
rock_samples.rename(columns={'Weight (g)':'Weight (kg)'}, inplace=True)
rock_samples

         ID   Mission     Type   Subtype  Weight (kg)  Pristine (%)
0     10001  Apollo11     Soil  Unsieved      0.12580         88.36
1     10002  Apollo11     Soil  Unsieved      5.62900         93.73
2     10003  Apollo11   Basalt  Ilmenite      0.21300         65.56
3     10004  Apollo11     Core  Unsieved      0.04480         71.76
4     10005  Apollo11     Core  Unsieved      0.05340         40.31
...     ...       ...      ...       ...          ...           ...
2224  79528  Apollo17  Breccia  Regolith      0.00238        100.00
2225  79529  Apollo17  Breccia  Regolith      0.00184        100.00
2226  79535  Apollo17  Breccia  Regolith      0.00169        100.00
2227  79536  Apollo17  Breccia  Regolith      0.00166        100.00
2228  79537  Apollo17  Breccia  Regolith      0.00105        100.00

[2229 rows x 6 columns]

## mission별 data frame 만들기

In [52]:
# make empty dataframe and assign to 'missions'
missions = pd.DataFrame()
type(missions)

pandas.core.frame.DataFrame

In [53]:
# make new column in missions
missions['Mission'] = rock_samples['Mission'].unique()
missions

    Mission
0  Apollo11
1  Apollo12
2  Apollo14
3  Apollo15
4  Apollo16
5  Apollo17

## mission별 weight 합계: group by

In [54]:
# divide dataframe(rock_samples) by 'Mission'(column) => groupby()
# sum each mission's weight. => sum()
# return value is [series]
total_weight = rock_samples.groupby('Mission')['Weight (kg)'].sum()
total_weight

Mission
Apollo11     21.55424
Apollo12     34.34238
Apollo14     41.83363
Apollo15     75.39910
Apollo16     92.46262
Apollo17    109.44402
Name: Weight (kg), dtype: float64

In [55]:
# merge to missions (dataframe - series)
missions = pd.merge(missions, total_weight, on='Mission')
# rename column
missions.rename(columns={'Weight (kg)':'Sample Weight(kg)'}, inplace=True)
missions

    Mission  Sample Weight(kg)
0  Apollo11           21.55424
1  Apollo12           34.34238
2  Apollo14           41.83363
3  Apollo15           75.39910
4  Apollo16           92.46262
5  Apollo17          109.44402

## mission간 중량 차: diff(), filna()

In [56]:
# calculate difference 
missions['Weight diff'] = missions['Sample Weight(kg)'].diff()
missions

    Mission  Sample Weight(kg)  Weight diff
0  Apollo11           21.55424          NaN
1  Apollo12           34.34238     12.78814
2  Apollo14           41.83363      7.49125
3  Apollo15           75.39910     33.56547
4  Apollo16           92.46262     17.06352
5  Apollo17          109.44402     16.98140

In [57]:
# replace NaN to 0
missions.fillna(value=0, inplace=True)
missions

    Mission  Sample Weight(kg)  Weight diff
0  Apollo11           21.55424      0.00000
1  Apollo12           34.34238     12.78814
2  Apollo14           41.83363      7.49125
3  Apollo15           75.39910     33.56547
4  Apollo16           92.46262     17.06352
5  Apollo17          109.44402     16.98140

## add spaceship data

In [58]:
# 달 탐사선 = lunar module + command module = crewed area

In [59]:
# add lunar module data
missions['Lunar module(LM)'] = ['Eagle (LM-5)', 'Interpid (LM-6)', 'Antares (LM-8)', 'Falcon (LM-10)', 'Orion (LM-11)', 'Challenger (LM-12)']
missions['LM mass(kg)'] = [15103, 15235, 15264, 16430, 16445, 16456]
missions['LM mass diff'] = missions['LM mass(kg)'].diff()
missions.fillna(value=0, inplace=True)
missions

,Mission,Sample Weight(kg),Weight diff,Lunar module(LM),LM mass(kg),LM mass diff
0,Apollo11,21.55424,0.00000,Eagle (LM-5),15103,0.0
1,Apollo12,34.34238,12.78814,Interpid (LM-6),15235,132.0
2,Apollo14,41.83363,7.49125,Antares (LM-8),15264,29.0
3,Apollo15,75.39910,33.56547,Falcon (LM-10),16430,1166.0
4,Apollo16,92.46262,17.06352,Orion (LM-11),16445,15.0
5,Apollo17,109.44402,16.98140,Challenger (LM-12),16456,11.0

In [60]:
# add command module data
missions['Command module(CM)'] = ['Columbia (CSM-107)', 'Yankee Clipper (CSM-108)', 'Kitty Hawk (CSM-110)', 'Endeavor (CSM-112)', 'Casper (CSM-113)', 'America (CSM-114)']
missions['CM mass(kg)'] = [5560, 5609, 5758, 5875, 5840, 5960]
missions['CM mass diff'] = missions['CM mass(kg)'].diff()
missions.fillna(value=0, inplace=True)
missions

,Mission,Sample Weight(kg),Weight diff,Lunar module(LM),LM mass(kg),LM mass diff,Command module(CM),CM mass(kg),CM mass diff
0,Apollo11,21.55424,0.00000,Eagle (LM-5),15103,0.0,Columbia (CSM-107),5560,0.0
1,Apollo12,34.34238,12.78814,Interpid (LM-6),15235,132.0,Yankee Clipper (CSM-108),5609,49.0
2,Apollo14,41.83363,7.49125,Antares (LM-8),15264,29.0,Kitty Hawk (CSM-110),5758,149.0
3,Apollo15,75.39910,33.56547,Falcon (LM-10),16430,1166.0,Endeavor (CSM-112),5875,117.0
4,Apollo16,92.46262,17.06352,Orion (LM-11),16445,15.0,Casper (CSM-113),5840,-35.0
5,Apollo17,109.44402,16.98140,Challenger (LM-12),16456,11.0,America (CSM-114),5960,120.0

In [61]:
# add crewed area data
missions['Total weight(kg)'] = missions['LM mass(kg)'] + missions['CM mass(kg)']
missions['Total weight diff'] = missions['LM mass diff'] + missions['CM mass diff']
missions

,Mission,Sample Weight(kg),Weight diff,Lunar module(LM),LM mass(kg),LM mass diff,Command module(CM),CM mass(kg),CM mass diff,Total weight(kg),Total weight diff
0,Apollo11,21.55424,0.00000,Eagle (LM-5),15103,0.0,Columbia (CSM-107),5560,0.0,20663,0.0
1,Apollo12,34.34238,12.78814,Interpid (LM-6),15235,132.0,Yankee Clipper (CSM-108),5609,49.0,20844,181.0
2,Apollo14,41.83363,7.49125,Antares (LM-8),15264,29.0,Kitty Hawk (CSM-110),5758,149.0,21022,178.0
3,Apollo15,75.39910,33.56547,Falcon (LM-10),16430,1166.0,Endeavor (CSM-112),5875,117.0,22305,1283.0
4,Apollo16,92.46262,17.06352,Orion (LM-11),16445,15.0,Casper (CSM-113),5840,-35.0,22285,-20.0
5,Apollo17,109.44402,16.98140,Challenger (LM-12),16456,11.0,America (CSM-114),5960,120.0,22416,131.0

In [62]:
# add payload data (payload=loaded stuffs total weight at spaceship)
saturnVPayload = 43500
# ratio about crewed area by payload
missions['Crewd area : Payload'] = missions['Total weight(kg)'] / saturnVPayload
# ratio about sample by crewed area
missions['Sample : Crewed area'] = missions['Sample Weight(kg)'] / missions['Total weight(kg)']
# ratio about sample by payload
missions['Sample : Payload'] = missions['Sample Weight(kg)'] / saturnVPayload
missions

,Mission,Sample Weight(kg),Weight diff,Lunar module(LM),LM mass(kg),LM mass diff,Command module(CM),CM mass(kg),CM mass diff,Total weight(kg),Total weight diff,Crewd area : Payload,Sample : Crewed area,Sample : Payload
0,Apollo11,21.55424,0.00000,Eagle (LM-5),15103,0.0,Columbia (CSM-107),5560,0.0,20663,0.0,0.475011,0.001043,0.000495
1,Apollo12,34.34238,12.78814,Interpid (LM-6),15235,132.0,Yankee Clipper (CSM-108),5609,49.0,20844,181.0,0.479172,0.001648,0.000789
2,Apollo14,41.83363,7.49125,Antares (LM-8),15264,29.0,Kitty Hawk (CSM-110),5758,149.0,21022,178.0,0.483264,0.001990,0.000962
3,Apollo15,75.39910,33.56547,Falcon (LM-10),16430,1166.0,Endeavor (CSM-112),5875,117.0,22305,1283.0,0.512759,0.003380,0.001733
4,Apollo16,92.46262,17.06352,Orion (LM-11),16445,15.0,Casper (CSM-113),5840,-35.0,22285,-20.0,0.512299,0.004149,0.002126
5,Apollo17,109.44402,16.98140,Challenger (LM-12),16456,11.0,America (CSM-114),5960,120.0,22416,131.0,0.515310,0.004882,0.002516

# 데이터 분석

## atemis_mission dataframe

In [63]:
artemis_crewdArea = 26520

# input at dictionary
artemis_dic = {'Mission':['artemis1', 'artemis1b', 'artemis2'],
                'Total weight(kg)':[artemis_crewdArea, artemis_crewdArea, artemis_crewdArea],
                'Payload(kg)':[26988, 37965, 42955]}
# make dataframe by dictionary
artemis_mission = pd.DataFrame(artemis_dic)
artemis_mission

     Mission  Total weight(kg)  Payload(kg)
0   artemis1             26520        26988
1  artemis1b             26520        37965
2   artemis2             26520        42955

## estimate sample weight

In [64]:
# calculate average each ratio
crewedArea_payload_ratio = missions['Crewd area : Payload'].mean()
sample_crewedArea_ratio = missions['Sample : Crewed area'].mean()
sample_payload_ratio = missions['Sample : Payload'].mean()

In [65]:
# input expected sample weight
artemis_mission['Sample weight from total(kg)'] = artemis_mission['Total weight(kg)'] * sample_crewedArea_ratio
artemis_mission['Sample weight from payload(kg)'] = artemis_mission['Total weight(kg)'] * sample_payload_ratio
artemis_mission

,Mission,Total weight(kg),Payload(kg),Sample weight from total(kg),Sample weight from payload(kg)
0,artemis1,26520,26988,75.549232,38.107105
1,artemis1b,26520,37965,75.549232,38.107105
2,artemis2,26520,42955,75.549232,38.107105

In [66]:
# input estimated sample weight
artemis_mission['Estimated sample weight(kg)'] = (artemis_mission['Sample weight from payload(kg)'] + artemis_mission['Sample weight from total(kg)'])/2
artemis_mission

,Mission,Total weight(kg),Payload(kg),Sample weight from total(kg),Sample weight from payload(kg),Estimated sample weight(kg)
0,artemis1,26520,26988,75.549232,38.107105,56.828168
1,artemis1b,26520,37965,75.549232,38.107105,56.828168
2,artemis2,26520,42955,75.549232,38.107105,56.828168